Documents/ЛБ_Доверенности.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>ЛБ_Доверенности</Name>
			<BasedOn>
				<xr:Item>Document.ЛБ_ОперацияПоЗалогу</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.ЛБ_Доверенности</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВидДоверенности</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ЛБ_ВидыДоверенностей</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗалоговыйБилет</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЛБ_ОперацияПоЗалогу</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Клиент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_Залогодатели</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПредставительКлиента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_Залогодатели</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерДоверенности</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СерияДоверенности</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаДоверенности</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СрокДействияДоверенности</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
						<v8:Type>cfg:CatalogRef.ЛБ_Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидОперации</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ЛБ_ВидыОперацийДоверенность</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтзываемаяДоверенность</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЛБ_Доверенности</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументКлиента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_ДокументыЗалогодателя</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументПредставителяКлиента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_ДокументыЗалогодателя</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>id_LX</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ломбард</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_Ломбарды</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МестоВыдачи</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФИОНотариуса</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

InformationRegisters/ЛБ_ДокументыЗалогодателей.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ЛБ_ДокументыЗалогодателей</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Гражданство</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтраныМира</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОсновнойДУЛ</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОсновнойДоп</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДокументДатаВыдачи</Name>
					<Comment>Дата выдачи документа</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДокументКемВыдан</Name>
					<Comment>Кем выдан </Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДокументКодПодразделения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДокументСерия</Name>
					<Comment>Серия документа</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>14</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДокументНомер</Name>
					<Comment>Номер документа</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДокументНачалоДействия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДокументСрокДействия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДокументНеДействителен</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаСмерти</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДокументДействителен</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДокументСтранаЭмитент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтраныМира</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДокументНаименованиеИногоДокумента</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ПричинаИзменения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_ПричиныИзмененияКарточкиЗалогодателя</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Изменения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ДокументЗалогодателя</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_ДокументыЗалогодателя</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидДокументаЗалогодателя</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ЛБ_ВидыДокументовЗалогодателя</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидДокумента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыДокументовФизическихЛиц</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/ЛБ_ВидыДоверенностей.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ЛБ_ВидыДоверенностей</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Нотариальная</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Письменная</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СвидетельствоОСмерти</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Documents/ЛБ_Доверенности/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда


//Код Ольги Зыковой
/// Заполняет список команд печати.
// 
// Параметры:
//   КомандыПечати - ТаблицаЗначений - состав полей см. в функции УправлениеПечатью.СоздатьКоллекциюКомандПечати
//
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт
	КомандаПечати = КомандыПечати.Добавить(); 
	КомандаПечати.МенеджерПечати = "Документ.ЛБ_Доверенности";
	КомандаПечати.Идентификатор = "Доверенность";
	КомандаПечати.Представление = НСтр("ru = 'Доверенность'");
	//КомандаПечати.Обработчик    = "УправлениеПечатьюБПКлиент.ВыполнитьКомандуПечати";
	ПодключаемыеКоманды.ДобавитьУсловиеВидимостиКоманды(КомандаПечати, "ВидДоверенности", Перечисления.ЛБ_ВидыДоверенностей.Письменная);
	
	КомандаПечати = КомандыПечати.Добавить(); 
	КомандаПечати.МенеджерПечати = "Документ.ЛБ_Доверенности";
	КомандаПечати.Идентификатор = "ДоверенностьОтмена";
	КомандаПечати.Представление = НСтр("ru = 'Отмена доверенности'");
	//КомандаПечати.Обработчик    = "УправлениеПечатьюБПКлиент.ВыполнитьКомандуПечати"; 
	ПодключаемыеКоманды.ДобавитьУсловиеВидимостиКоманды(КомандаПечати, "ВидДоверенности", Перечисления.ЛБ_ВидыДоверенностей.Письменная);
КонецПроцедуры	

Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт	
	
	// Устанавливаем признак доступности печати покомплектно.
	ПараметрыВывода.ДоступнаПечатьПоКомплектно = Истина;
		
	Если КоллекцияПечатныхФорм.Получить(0).ИмяМакета = "Доверенность"  Тогда
		// Проверяем, нужно ли для макета ЗаключениеОбОценке формировать табличный документ.
		Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "Доверенность") Тогда
		
		// Формируем табличный документ и добавляем его в коллекцию печатных форм.
			УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, "Доверенность", "Доверенность", 
				ПечатьДоверенности(МассивОбъектов, ОбъектыПечати), , "Документ.ЛБ_Доверенности.Доверенность");
		КонецЕсли;
	Иначе
		Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "ДоверенностьОтмена") Тогда
		
		// Формируем табличный документ и добавляем его в коллекцию печатных форм.
			УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, "ДоверенностьОтмена", "Отмена доверенности", 
				ПечатьОтменаДоверенности(МассивОбъектов, ОбъектыПечати), , "Документ.ЛБ_Доверенности.Доверенность");
		КонецЕсли;
	КонецЕсли;	
		
//	ОбщегоНазначенияБП.ЗаполнитьДополнительныеПараметрыПечати(МассивОбъектов, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода);	
		
	
КонецПроцедуры

Функция СформироватьИнфомациюДУЛ(Документ, Дата, ПерваяБукваСтрочная = Ложь) 
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Дата", Дата); 
	Запрос.УстановитьПараметр("Документ", Документ);
    Запрос.Текст = "ВЫБРАТЬ
                   |	ЛБ_ДокументыЗалогодателейСрезПоследних.ВидДокумента КАК ВидДокумента,
                   |	ЛБ_ДокументыЗалогодателейСрезПоследних.ДокументДатаВыдачи КАК ДокументДатаВыдачи,
                   |	ЛБ_ДокументыЗалогодателейСрезПоследних.ДокументКемВыдан КАК ДокументКемВыдан,
                   |	ЛБ_ДокументыЗалогодателейСрезПоследних.ДокументКодПодразделения КАК ДокументКодПодразделения,
                   |	ЛБ_ДокументыЗалогодателейСрезПоследних.ДокументСерия КАК ДокументСерия,
                   |	ЛБ_ДокументыЗалогодателейСрезПоследних.ДокументНомер КАК ДокументНомер,
                   |	ЛБ_ДокументыЗалогодателейСрезПоследних.ДокументСрокДействия КАК ДокументСрокДействия
                   |ИЗ
                   |	РегистрСведений.ЛБ_ДокументыЗалогодателей.СрезПоследних(&Дата, ДокументЗалогодателя = &Документ) КАК ЛБ_ДокументыЗалогодателейСрезПоследних"; 
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда 
		Информация = "";
		Если ПерваяБукваСтрочная Тогда
		    Информация = СокрЛП(Выборка.ВидДокумента);
			Если СтрДлина(Информация)  > 2 Тогда
			    Информация = СтрШаблон("%1%2", НРег(Лев(Информация, 1)), Сред(Информация, 2))
			КонецЕсли;
		Иначе
		    Информация = СокрЛП(Выборка.ВидДокумента);
		КонецЕсли;
		Информация = Информация + ?(ЗначениеЗаполнено(Выборка.ДокументСерия), " " + СокрЛП(Выборка.ДокументСерия), "");
		Информация = Информация + ?(ЗначениеЗаполнено(Выборка.ДокументНомер), " " + СокрЛП(Выборка.ДокументНомер), "");
		Информация = Информация + ?(ЗначениеЗаполнено(Выборка.ДокументКемВыдан), " выдан " + СокрЛП(Выборка.ДокументКемВыдан), "");
		Информация = Информация + ?(ЗначениеЗаполнено(Выборка.ДокументДатаВыдачи), " " + Формат(Выборка.ДокументДатаВыдачи,"ДФ=dd.MM.yyyy"), "");
		Информация = Информация + ?(ЗначениеЗаполнено(Выборка.ДокументКодПодразделения), " код подр. " + СокрЛП(Выборка.ДокументКодПодразделения), "");
		Информация = Информация + ?(ЗначениеЗаполнено(Выборка.ДокументСрокДействия), " действует до " + Формат(Выборка.ДокументСрокДействия,"ДФ=dd.MM.yyyy"), "");
        Возврат Информация;
	КонецЕсли;
	Возврат "";
КонецФункции

Функция ВыбратьКонтактуюИнформацию(Клиент, Дата) 
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Дата", Дата); 
	Запрос.УстановитьПараметр("Клиент", Клиент);
	//+МАН 13.12.24 Изменил запрос для волучения ФИО. Заявка 2806
	//Запрос.Текст = "ВЫБРАТЬ
	//               |	ЛБ_КонтактнаяИнформацияЗалогодателейСрезПоследних.АдресПоПрописке КАК АдресПоПрописке,
	//               |	ЛБ_КонтактнаяИнформацияЗалогодателейСрезПоследних.ФактическийАдрес КАК ФактическийАдрес,
	//               |	ЛБ_КонтактнаяИнформацияЗалогодателейСрезПоследних.ДатаРождения КАК ДатаРождения
	//               |ИЗ
	//               |	РегистрСведений.ЛБ_КонтактнаяИнформацияЗалогодателей.СрезПоследних(&Дата, Залогодатель = &Клиент) КАК ЛБ_КонтактнаяИнформацияЗалогодателейСрезПоследних";

	Запрос.Текст = "ВЫБРАТЬ
	               |	ЛБ_КонтактнаяИнформацияЗалогодателейСрезПоследних.АдресПоПрописке КАК АдресПоПрописке,
	               |	ЛБ_КонтактнаяИнформацияЗалогодателейСрезПоследних.ФактическийАдрес КАК ФактическийАдрес,
	               |	ЛБ_КонтактнаяИнформацияЗалогодателейСрезПоследних.ДатаРождения КАК ДатаРождения,
	               |	ЛБ_КонтактнаяИнформацияЗалогодателейСрезПоследних.Фамилия КАК Фамилия,
	               |	ЛБ_КонтактнаяИнформацияЗалогодателейСрезПоследних.Имя КАК Имя,
	               |	ЛБ_КонтактнаяИнформацияЗалогодателейСрезПоследних.Отчество КАК Отчество
	               |ИЗ
	               |	РегистрСведений.ЛБ_КонтактнаяИнформацияЗалогодателей.СрезПоследних(&Дата, Залогодатель = &Клиент) КАК ЛБ_КонтактнаяИнформацияЗалогодателейСрезПоследних";
	//-МАН
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда 
		СтруктураВ = Новый Структура;
		СтруктураВ.Вставить("Адрес", ?(НЕ ПустаяСтрока(Выборка.АдресПоПрописке), Выборка.АдресПоПрописке, Выборка.ФактическийАдрес));
		СтруктураВ.Вставить("ДатаРождения", Выборка.ДатаРождения);
		//+МАН 13.12.24 Заявка 2806
		СтруктураВ.Вставить("ФИО", "" + Выборка.Фамилия + " " + Выборка.Имя + ?(ПустаяСтрока(Выборка.Отчество), "", " " + Выборка.Отчество));
		//-МАН
	    Возврат СтруктураВ;
	КонецЕсли;
	Возврат неопределено;
КонецФункции   

Функция ПолучитьГород(Ломбард)
	ОтборКИ = Новый Структура;
	ОтборКИ.Вставить("Тип", Перечисления.ТипыКонтактнойИнформации.Адрес); 
	ОтборКИ.Вставить("Вид", справочники.ВидыКонтактнойИнформации.ФактАдресЛомбарда);
	СтрокиКИ = Ломбард.КонтактнаяИнформация.НайтиСтроки(ОтборКИ);
	Если строкиКИ.Количество() = 0 Тогда 
		Возврат "";
	Иначе
		Возврат СтрокиКИ.Получить(0).Город;
	КонецЕсли;	
КонецФункции	
	
Функция ПечатьДоверенности(МассивОбъектов, ОбъектыПечати)
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент.ТолькоПросмотр = Истина;
	ТабличныйДокумент.АвтоМасштаб    = Истина;
	//ТабличныйДокумент.ОриентацияСтраницы	= ОриентацияСтраницы.Портрет;
	//ТабличныйДокумент.КлючПараметровПечати	= "ПАРАМЕТРЫ_ПЕЧАТИ_Доверенность";
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		//+МАН 22.04.25 Заменил номер документа на номер ЗБ.
		//Было: |	ЛБ_Доверенности.ЗалоговыйБилет.Номер КАК ЗалоговыйБилетНомер,
		|	ЛБ_Доверенности.ЗалоговыйБилет.НомерЗалоговогоБилета КАК ЗалоговыйБилетНомер,
		//-МАН
		|	ЛБ_Доверенности.ЗалоговыйБилет.Дата КАК ЗалоговыйБилетДата,
		|	ЛБ_Доверенности.Дата КАК Дата,
		|	ЛБ_Доверенности.ДатаДоверенности КАК ДатаДоверенности,
		|	ЛБ_Доверенности.СрокДействияДоверенности КАК СрокДействияДоверенности,
		|	ЛБ_Доверенности.Клиент.Фамилия КАК КлиентФамилия,
		|	ЛБ_Доверенности.Клиент.Отчество КАК КлиентОтчество,
		|	ЛБ_Доверенности.Клиент.Имя КАК КлиентИмя,
		|	ЛБ_Доверенности.ПредставительКлиента.Фамилия КАК ПредставительКлиентаФамилия,
		|	ЛБ_Доверенности.ПредставительКлиента.Имя КАК ПредставительКлиентаИмя,
		|	ЛБ_Доверенности.ПредставительКлиента.Отчество КАК ПредставительКлиентаОтчество,
		|	ЛБ_Доверенности.ДокументКлиента КАК ДокументКлиента,
		|	ЛБ_Доверенности.ДокументПредставителяКлиента КАК ДокументПредставителяКлиента,
		|	ЛБ_Доверенности.Ломбард КАК Ломбард,
		|	ЛБ_Доверенности.Клиент КАК Клиент,
		|	ЛБ_Доверенности.ПредставительКлиента КАК ПредставительКлиента,
		|	ЛБ_Доверенности.Ответственный КАК Ответственный
		|ИЗ
		|	Документ.ЛБ_Доверенности КАК ЛБ_Доверенности
		|ГДЕ
		|	ЛБ_Доверенности.Ссылка В(&МассивОбъектов)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ЛБ_ОсновнаяОрганизация.Значение.НаименованиеСокращенное КАК ЗначениеНаименованиеСокращенное,
		|	Организации.НаименованиеСокращенное КАК НаименованиеСокращенное
		|ИЗ
		|	Константа.ЛБ_ОсновнаяОрганизация КАК ЛБ_ОсновнаяОрганизация
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Организации КАК Организации
		|		ПО ЛБ_ОсновнаяОрганизация.Значение = Организации.Ссылка";
	
	
	Запрос.УстановитьПараметр("МассивОбъектов", МассивОбъектов);          	
	
	МассивРезультатовЗапроса = Запрос.ВыполнитьПакет();
	
	РезультДанныеДоверенности = МассивРезультатовЗапроса[0];
	РезультДанныеОрганизации = МассивРезультатовЗапроса[1];
	
	
	ВыборкаДанныеДоверенности = РезультДанныеДоверенности.Выбрать();
	ВыборкаДанныеДоверенности.Следующий();
	
	ВыборкаДанныеОрганизации = РезультДанныеОрганизации.Выбрать();
	ВыборкаДанныеОрганизации.Следующий();
	
	// Получаем макет
	Макет = ПолучитьМакет("Доверенность2ЭкземпляраНаСтранице");
		
	// Формируем основную часть.
	ОбластьМакетаШапка = Макет.ПолучитьОбласть("Шапка");
	ОбластьМакетаШапка.Параметры.Дата 			= Формат(ВыборкаДанныеДоверенности.ДатаДоверенности, "ДЛФ=DD");
	ОбластьМакетаШапка.Параметры.Организация 	= ВыборкаДанныеОрганизации.ЗначениеНаименованиеСокращенное;      
	ОбластьМакетаШапка.Параметры.Город = ПолучитьГород(ВыборкаДанныеДоверенности.Ломбард);
	ТабличныйДокумент.Вывести(ОбластьМакетаШапка);
	
	ОбластьМакетаТекст = Макет.ПолучитьОбласть("Текст");
	
	СтрутураКИКлиент = ВыбратьКонтактуюИнформацию(ВыборкаДанныеДоверенности.Клиент, ВыборкаДанныеДоверенности.Дата); 
	Если СтрутураКИКлиент = неопределено Тогда   
		ДРКлиент = Дата(1,1,1);
		АдресКлиент = "";
	Иначе  
		ДРКлиент = СтрутураКИКлиент.ДатаРождения;
		АдресКлиент = СтрутураКИКлиент.Адрес;
	КонецЕсли;	
	//ОбластьМакетаТекст.Параметры.Заемщик = (ВыборкаДанныеДоверенности.КлиентФамилия +" "+ ВыборкаДанныеДоверенности.КлиентИмя +" "+ ВыборкаДанныеДоверенности.КлиентОтчество); 
	
	//+МАН 16.12.24 Используем ФИО на момент создания доверенности. Заявка 2806
	//Было:
	//ЗаемщикОтчество = ?(ПустаяСтрока(ВыборкаДанныеДоверенности.КлиентОтчество), "", СтрШаблон(" %1", ВыборкаДанныеДоверенности.КлиентОтчество));
	//ЗаемщикТекстом = СтрШаблон("%1 %2%3", ВыборкаДанныеДоверенности.КлиентФамилия, ВыборкаДанныеДоверенности.КлиентИмя, ЗаемщикОтчество);
	//ОбластьМакетаТекст.Параметры.Заемщик                        = ВРег(ЗаемщикТекстом);
	//Стало:
	ОбластьМакетаТекст.Параметры.Заемщик                        = СтрутураКИКлиент.ФИО;
	//-МАН
	
	ОбластьМакетаТекст.Параметры.ДатаРожденияЗаемщика			= Формат(ДРКлиент, "ДФ=dd.MM.yyyy");
	ОбластьМакетаТекст.Параметры.УдостоверяющийДокументЗаемщика = СформироватьИнфомациюДУЛ(ВыборкаДанныеДоверенности.ДокументКлиента, ВыборкаДанныеДоверенности.Дата, Истина);
	ОбластьМакетаТекст.Параметры.АдресРегистрацииЗаемщика 		= АдресКлиент;
	
	СтрутураКИКлиент = ВыбратьКонтактуюИнформацию(ВыборкаДанныеДоверенности.ПредставительКлиента, ВыборкаДанныеДоверенности.Дата); 
	Если СтрутураКИКлиент = неопределено Тогда   
		ДРПредставитель = Дата(1,1,1);
		АдресПредставитель = "";
	Иначе  
		ДРПредставитель = СтрутураКИКлиент.ДатаРождения;
		АдресПредставитель = СтрутураКИКлиент.Адрес;
	КонецЕсли;	
	//ОбластьМакетаТекст.Параметры.Представитель = (ВыборкаДанныеДоверенности.ПредставительКлиентаФамилия +" "+ ВыборкаДанныеДоверенности.ПредставительКлиентаИмя +" "+ ВыборкаДанныеДоверенности.ПредставительКлиентаОтчество);
	
	//+МАН 16.12.24 Используем ФИО на момент создания доверенности. Заявка 2806
	//Было:
	//ПредставительОтчество = ?(ПустаяСтрока(ВыборкаДанныеДоверенности.ПредставительКлиентаОтчество), "", СтрШаблон(" %1", ВыборкаДанныеДоверенности.ПредставительКлиентаОтчество));
	//ПредставительТекстом = СтрШаблон("%1 %2%3", ВыборкаДанныеДоверенности.ПредставительКлиентаФамилия, ВыборкаДанныеДоверенности.ПредставительКлиентаИмя, ПредставительОтчество);
	//ОбластьМакетаТекст.Параметры.Представитель                          = ВРег(ПредставительТекстом);
	//Стало:
	ОбластьМакетаТекст.Параметры.Представитель                          = СтрутураКИКлиент.ФИО;
	//-МАН
	
	ОбластьМакетаТекст.Параметры.ДатаРожденияПредставителя 				= Формат(ДРПредставитель, "ДФ=dd.MM.yyyy");;
	ОбластьМакетаТекст.Параметры.УдостоверяющийДокументПредставителя 	= СформироватьИнфомациюДУЛ(ВыборкаДанныеДоверенности.ДокументПредставителяКлиента, ВыборкаДанныеДоверенности.Дата, Истина);
	ОбластьМакетаТекст.Параметры.АдресРегистрацииПредставителя 			= АдресПредставитель;
	ОбластьМакетаТекст.Параметры.Организация 	= ВыборкаДанныеОрганизации.ЗначениеНаименованиеСокращенное;
	
	НомерЗБ = ВыборкаДанныеДоверенности.ЗалоговыйБилетНомер;
	
	Пока Лев (НомерЗБ, 1) = "0" Цикл
		НомерЗБ = Прав(НомерЗБ, СтрДлина(НомерЗБ)-1);
	КонецЦикла;
	
	ОбластьМакетаТекст.Параметры.НомерЗБ 		= НомерЗБ;
	
	ОбластьМакетаТекст.Параметры.ДатаЗБ 		= Формат(ВыборкаДанныеДоверенности.ЗалоговыйБилетДата, "ДФ=dd.MM.yyyy");
	
	ТабличныйДокумент.Вывести(ОбластьМакетаТекст);
	
	ОбластьМакетаПодвал = Макет.ПолучитьОбласть("Подвал");
	// ++ Сербаев 09.06.2023
	//ОбластьМакетаПодвал.Параметры.СрокДействия = Формат(ВыборкаДанныеДоверенности.СрокДействияДоверенности, "ДЛФ=DD");
	ОбластьМакетаПодвал.Параметры.СрокДействия = Формат(ВыборкаДанныеДоверенности.СрокДействияДоверенности, "ДФ=dd.MM.yyyy");
	// -- Сербаев 09.06.2023
	ОбластьМакетаПодвал.Параметры.Дата = (Формат(ВыборкаДанныеДоверенности.Дата, "ДФ=dd.MM.yyyy"))+" г.";
	// ++ Сербаев 09.06.2023
	//ОбластьМакетаПодвал.Параметры.Заемщик = (ВыборкаДанныеДоверенности.КлиентФамилия +" "+ ВыборкаДанныеДоверенности.КлиентИмя +" "+ ВыборкаДанныеДоверенности.КлиентОтчество);
	ОбластьМакетаПодвал.Параметры.Заемщик = "";
	// -- Сербаев 09.06.2023
	ОбластьМакетаПодвал.Параметры.Работник = ВыборкаДанныеДоверенности.Ответственный;
	ТабличныйДокумент.Вывести(ОбластьМакетаПодвал);  
		
	
    // ++ Сербаев 21.06.2023 
	ОбластьМакетаРазделитель = Макет.ПолучитьОбласть("Разделитель");
	ТабличныйДокумент.Вывести(ОбластьМакетаРазделитель); 
	
	ТабличныйДокумент.Присоединить(ТабличныйДокумент); 
	
	СтрокаРазделителя = ТабличныйДокумент.ВысотаТаблицы;
	ТабличныйДокумент.УдалитьОбласть(ТабличныйДокумент.Область(СтрокаРазделителя, , СтрокаРазделителя), ТипСмещенияТабличногоДокумента.ПоВертикали);
	// -- Сербаев 21.06.2023
	
	Возврат ТабличныйДокумент;

КонецФункции

Функция ПечатьОтменаДоверенности(МассивОбъектов, ОбъектыПечати)
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент.АвтоМасштаб	 = Истина;
	ТабличныйДокумент.ТолькоПросмотр = Истина;
	//ТабличныйДокумент.ОриентацияСтраницы	= ОриентацияСтраницы.Ландшафт;
	//ТабличныйДокумент.КлючПараметровПечати	= "ПАРАМЕТРЫ_ПЕЧАТИ_УведомлениеОбОтменеДоверенности";

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		//+МАН 22.04.25 Заменил номер документа на номер ЗБ.
		//Было: |	ЛБ_Доверенности.ЗалоговыйБилет.Номер КАК ЗалоговыйБилетНомер,
		|	ЛБ_Доверенности.ЗалоговыйБилет.НомерЗалоговогоБилета КАК ЗалоговыйБилетНомер,
		//-МАН
		|	ЛБ_Доверенности.ЗалоговыйБилет.Дата КАК ЗалоговыйБилетДата,
		|	ЛБ_Доверенности.Дата КАК Дата,
		|	ЛБ_Доверенности.ДатаДоверенности КАК ДатаДоверенности,
		|	ЛБ_Доверенности.СрокДействияДоверенности КАК СрокДействияДоверенности,
		|	ЛБ_Доверенности.Клиент.Фамилия КАК КлиентФамилия,
		|	ЛБ_Доверенности.Клиент.Отчество КАК КлиентОтчество,
		|	ЛБ_Доверенности.Клиент.Имя КАК КлиентИмя,
		|	ЛБ_Доверенности.ПредставительКлиента.Фамилия КАК ПредставительКлиентаФамилия,
		|	ЛБ_Доверенности.ПредставительКлиента.Имя КАК ПредставительКлиентаИмя,
		|	ЛБ_Доверенности.ПредставительКлиента.Отчество КАК ПредставительКлиентаОтчество,
		|	ЛБ_Доверенности.ДокументКлиента КАК ДокументКлиента,
		|	ЛБ_Доверенности.ДокументПредставителяКлиента КАК ДокументПредставителяКлиента,
		|	ЛБ_Доверенности.Ломбард КАК Ломбард,
		|	ЛБ_Доверенности.Клиент КАК Клиент,
		|	ЛБ_Доверенности.ПредставительКлиента КАК ПредставительКлиента,
		|	ЛБ_Доверенности.Ответственный КАК Ответственный
		|ИЗ
		|	Документ.ЛБ_Доверенности КАК ЛБ_Доверенности
		|ГДЕ
		|	ЛБ_Доверенности.Ссылка В(&МассивОбъектов)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ЛБ_ОсновнаяОрганизация.Значение.НаименованиеСокращенное КАК ЗначениеНаименованиеСокращенное,
		|	Организации.НаименованиеСокращенное КАК НаименованиеСокращенное
		|ИЗ
		|	Константа.ЛБ_ОсновнаяОрганизация КАК ЛБ_ОсновнаяОрганизация
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Организации КАК Организации
		|		ПО ЛБ_ОсновнаяОрганизация.Значение = Организации.Ссылка";

	
	Запрос.УстановитьПараметр("МассивОбъектов", МассивОбъектов);          	
	
	МассивРезультатовЗапроса = Запрос.ВыполнитьПакет();
	
	РезультДанныеДоверенности = МассивРезультатовЗапроса[0];
	РезультДанныеОрганизации = МассивРезультатовЗапроса[1];
	
	ВыборкаДанныеДоверенности = РезультДанныеДоверенности.Выбрать();
	ВыборкаДанныеДоверенности.Следующий();
	
	ВыборкаДанныеОрганизации = РезультДанныеОрганизации.Выбрать();
	ВыборкаДанныеОрганизации.Следующий();
	 		
	// Получаем макет
	Макет = ПолучитьМакет("ДоверенностьОтмена2ЭкземпляраНаСтранице");
		
	// Формируем основную часть.
	ОбластьМакетаШапка = Макет.ПолучитьОбласть("Шапка");
	ОбластьМакетаШапка.Параметры.Дата = Формат(ВыборкаДанныеДоверенности.ДатаДоверенности, "ДЛФ=DD"); 
	ОбластьМакетаШапка.Параметры.Город = ПолучитьГород(ВыборкаДанныеДоверенности.Ломбард);
	ТабличныйДокумент.Вывести(ОбластьМакетаШапка);
	
	ОбластьМакетаТекст = Макет.ПолучитьОбласть("Текст");
	
	СтрутураКИКлиент = ВыбратьКонтактуюИнформацию(ВыборкаДанныеДоверенности.Клиент, ВыборкаДанныеДоверенности.Дата); 
	Если СтрутураКИКлиент = неопределено Тогда   
		ДРКлиент = Дата(1,1,1);
		АдресКлиент = "";
	Иначе  
		ДРКлиент = СтрутураКИКлиент.ДатаРождения;
		АдресКлиент = СтрутураКИКлиент.Адрес;
	КонецЕсли;	
	//ОбластьМакетаТекст.Параметры.Заемщик = (ВыборкаДанныеДоверенности.КлиентФамилия +" "+ ВыборкаДанныеДоверенности.КлиентИмя +" "+ ВыборкаДанныеДоверенности.КлиентОтчество);
	ОтчествоЗаемщикаТекстом = ?(ПустаяСтрока(ВыборкаДанныеДоверенности.КлиентОтчество), "", СтрШаблон(" %1",ВыборкаДанныеДоверенности.КлиентОтчество));
	ЗаемщикТекстом = СтрШаблон("%1 %2%3", ВыборкаДанныеДоверенности.КлиентФамилия,ВыборкаДанныеДоверенности.КлиентИмя, ОтчествоЗаемщикаТекстом);
	ОбластьМакетаТекст.Параметры.Заемщик                        = ЗаемщикТекстом;
	ОбластьМакетаТекст.Параметры.ДатаРожденияЗаемщика			= Формат(ДРКлиент, "ДФ=dd.MM.yyyy");
	ОбластьМакетаТекст.Параметры.УдостоверяющийДокументЗаемщика = СформироватьИнфомациюДУЛ(ВыборкаДанныеДоверенности.ДокументКлиента, ВыборкаДанныеДоверенности.Дата, Истина);
	ОбластьМакетаТекст.Параметры.АдресРегистрацииЗаемщика 		= АдресКлиент;
	
	СтрутураКИКлиент = ВыбратьКонтактуюИнформацию(ВыборкаДанныеДоверенности.ПредставительКлиента, ВыборкаДанныеДоверенности.Дата); 
	Если СтрутураКИКлиент = неопределено Тогда   
		ДРПредставитель = Дата(1,1,1);
		АдресПредставитель = "";
	Иначе  
		ДРПредставитель = СтрутураКИКлиент.ДатаРождения;
		АдресПредставитель = СтрутураКИКлиент.Адрес;
	КонецЕсли;	
	//ОбластьМакетаТекст.Параметры.Представитель = (ВыборкаДанныеДоверенности.ПредставительКлиентаФамилия +" "+ ВыборкаДанныеДоверенности.ПредставительКлиентаИмя +" "+ ВыборкаДанныеДоверенности.ПредставительКлиентаОтчество);
	ОтчествоТекстом = ?(ПустаяСтрока(ВыборкаДанныеДоверенности.ПредставительКлиентаОтчество), "", СтрШаблон(" %1",ВыборкаДанныеДоверенности.ПредставительКлиентаОтчество));
	ПредставительТекстом = СтрШаблон("%1 %2%3", ВыборкаДанныеДоверенности.ПредставительКлиентаФамилия,ВыборкаДанныеДоверенности.ПредставительКлиентаИмя, ОтчествоТекстом);
	ОбластьМакетаТекст.Параметры.Представитель                       = ПредставительТекстом;
	ОбластьМакетаТекст.Параметры.ДатаРожденияПредставителя 		     = Формат(ДРПредставитель, "ДФ=dd.MM.yyyy");;
	ОбластьМакетаТекст.Параметры.УдостоверяющийДокументПредставителя = СформироватьИнфомациюДУЛ(ВыборкаДанныеДоверенности.ДокументПредставителяКлиента, ВыборкаДанныеДоверенности.Дата, Истина);
	ОбластьМакетаТекст.Параметры.АдресРегистрацииПредставителя 		 = АдресПредставитель;
	
	ОбластьМакетаТекст.Параметры.Организация 	= ВыборкаДанныеОрганизации.ЗначениеНаименованиеСокращенное;
	ОбластьМакетаТекст.Параметры.ДатаВыдачи 	= Формат(ВыборкаДанныеДоверенности.ДатаДоверенности, "ДЛФ=DD");
	
	НомерЗБ = ВыборкаДанныеДоверенности.ЗалоговыйБилетНомер;
	
	Пока Лев (НомерЗБ, 1) = "0" Цикл
		НомерЗБ = Прав(НомерЗБ, СтрДлина(НомерЗБ)-1);
	КонецЦикла;
	
	ОбластьМакетаТекст.Параметры.НомерЗБ 		= НомерЗБ;
	
	ОбластьМакетаТекст.Параметры.ДатаЗБ 		= Формат(ВыборкаДанныеДоверенности.ЗалоговыйБилетДата, "ДФ=dd.MM.yyyy");
	
	ТабличныйДокумент.Вывести(ОбластьМакетаТекст);
	
	ОбластьМакетаПодвал = Макет.ПолучитьОбласть("Подвал");
	ОбластьМакетаПодвал.Параметры.Дата = (Формат(ВыборкаДанныеДоверенности.Дата, "ДФ=dd.MM.yyyy"))+" г.";
	// ++ Сербаев 13.06.2023 
	//ОбластьМакетаПодвал.Параметры.Заемщик = (ВыборкаДанныеДоверенности.КлиентФамилия +" "+ ВыборкаДанныеДоверенности.КлиентИмя +" "+ ВыборкаДанныеДоверенности.КлиентОтчество);
	ОбластьМакетаПодвал.Параметры.Заемщик = "";
	// -- Сербаев 13.06.2023
	ОбластьМакетаПодвал.Параметры.Работник = ВыборкаДанныеДоверенности.Ответственный;
	ТабличныйДокумент.Вывести(ОбластьМакетаПодвал);

	// ++ Сербаев 21.06.2023 
	ОбластьМакетаРазделитель = Макет.ПолучитьОбласть("Разделитель");
	ТабличныйДокумент.Вывести(ОбластьМакетаРазделитель); 
	
	ТабличныйДокумент.Присоединить(ТабличныйДокумент); 
	
	СтрокаРазделителя = ТабличныйДокумент.ВысотаТаблицы;
	ТабличныйДокумент.УдалитьОбласть(ТабличныйДокумент.Область(СтрокаРазделителя, , СтрокаРазделителя), ТипСмещенияТабличногоДокумента.ПоВертикали);
	// -- Сербаев 21.06.2023
	
	Возврат ТабличныйДокумент;

КонецФункции


#КонецЕсли
